external/Flight Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Flight Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Clients" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Flight Creation" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </LoopController>
        <hashTree>
          <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="FlightIdCounter" enabled="true">
            <stringProp name="CounterConfig.start">5000</stringProp>
            <stringProp name="CounterConfig.incr">1</stringProp>
            <stringProp name="CounterConfig.name">flight_id_counter</stringProp>
            <boolProp name="CounterConfig.per_user">false</boolProp>
            <stringProp name="TestPlan.comments">Flight ID counter</stringProp>
          </CounterConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Flight ${flight_id_counter}" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;airportDeparture&quot;: &quot;AMS&quot;,&#xd;
	&quot;airportArrival&quot;: &quot;ZAG&quot;,&#xd;
	&quot;dateDeparture&quot;: &quot;2020-02-28T10:00:00.000Z&quot;,&#xd;
	&quot;dateArrival&quot;: &quot;2020-07-12T12:43:34.000Z&quot;,&#xd;
	&quot;numberOfPassengers&quot;: 1,&#xd;
	&quot;numberOfTransfers&quot;: 4,&#xd;
	&quot;company&quot;: &quot;Croatia Airlines&quot;,&#xd;
	&quot;flightId&quot;: &quot;ID${flight_id_counter}&quot;&#xd;
}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">tomislav-strelar.from.hr</stringProp>
            <stringProp name="HTTPSampler.port">443</stringProp>
            <stringProp name="HTTPSampler.protocol">https</stringProp>
            <stringProp name="HTTPSampler.path">/api/v1/flight</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
              <collectionProp name="HeaderManager.headers">
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Authorization</stringProp>
                  <stringProp name="Header.value">Bearer eyJhbGciOiJSUzI1NiIsInR5cCIgOiAiSldUIiwia2lkIiA6ICJVNWdpZlF0cV9kX2JNWi1NTXhnSjVJVjFEZ1ZWQkZLbHZlaThUMkYtM3dFIn0.eyJqdGkiOiJjMzM3N2M0ZS02ZDgxLTQ1N2QtYTEwZi1kZjkwM2I5NDM3YjQiLCJleHAiOjE1ODM2MTExNzgsIm5iZiI6MCwiaWF0IjoxNTgzNjEwODc4LCJpc3MiOiJodHRwczovL3RvbWlzbGF2LXN0cmVsYXIuZnJvbS5oci9hdXRoL3JlYWxtcy9mbGlnaHQtaW5mbyIsImF1ZCI6ImFjY291bnQiLCJzdWIiOiJlN2Q3OWRlMi03OTAzLTRlODAtODcxMy0xMDNkNzQ1MTExNGQiLCJ0eXAiOiJCZWFyZXIiLCJhenAiOiJmbGlnaHQtaW5mbyIsImF1dGhfdGltZSI6MTU4MzYwOTE2OSwic2Vzc2lvbl9zdGF0ZSI6ImJmZjk1MzAxLTNhZWQtNDI4YS1iYjFmLWE3MGZlOGE1N2Q1YyIsImFjciI6IjAiLCJyZWFsbV9hY2Nlc3MiOnsicm9sZXMiOlsib2ZmbGluZV9hY2Nlc3MiLCJ1bWFfYXV0aG9yaXphdGlvbiJdfSwicmVzb3VyY2VfYWNjZXNzIjp7ImZsaWdodC1pbmZvIjp7InJvbGVzIjpbIkFETUlOIiwiVVNFUiJdfSwiYWNjb3VudCI6eyJyb2xlcyI6WyJtYW5hZ2UtYWNjb3VudCIsIm1hbmFnZS1hY2NvdW50LWxpbmtzIiwidmlldy1wcm9maWxlIl19fSwic2NvcGUiOiJvcGVuaWQgcHJvZmlsZSBlbWFpbCIsImVtYWlsX3ZlcmlmaWVkIjp0cnVlLCJ1c2VyX25hbWUiOiJhZG1pbmlzdHJhdG9yIiwicHJlZmVycmVkX3VzZXJuYW1lIjoiYWRtaW5pc3RyYXRvciJ9.Dh1ghMuJUFeMLNjPHIQGXKJx4IneCr6p-rILIfBTKMJ0TThCpD6bQUyYQwzIcDixNauCBqun0FDBCDlqBF9AX6ULLJPu55uDmn6wdogkTsTEFXqtcWQChsiZrr33UHlFDL2XKOTIQz_i5_IrgszWtQZMQsZURYzRk56DAA85vGFhS3ypeCsVGhIlkH4o4IsiiPFW0-uj3anQmhbpOQTT2EAoQlYou_dOzrILnhaHOTlJi8qE4qgCjSUynqEniMUyywWGAxgLSGziNAVeiNVh9Qr-KB_5_V_mB9vPX4JKcmewh6k83TSTCPMtrqHWNLZQVWRH_wwxA0j5nPI7fMgsfw</stringProp>
                </elementProp>
                <elementProp name="" elementType="Header">
                  <stringProp name="Header.name">Content-Type</stringProp>
                  <stringProp name="Header.value">application/json</stringProp>
                </elementProp>
              </collectionProp>
            </HeaderManager>
            <hashTree/>
          </hashTree>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>